app/views/searches/show.html.erb

SELECT  1 AS one FROM `books` WHERE (category LIKE 'aaaa') LIMIT 1
SELECT `books`.* FROM `books` WHERE (category LIKE 'aaaa')
---

<% if @search.search_books.empty? %>