app/controllers/searches_controller.rb

SELECT `books`.`category` FROM `books`
---
    def new
		@search = Search.new
        @categories = Book.pluck(:category)

INSERT INTO `searches` (`keywords`, `category`, `min_price`, `created_at`, `updated_at`) VALUES ('', '', 1, '2017-05-17 05:54:11', '2017-05-17 05:54:11')
---
    def create
    	@search = Search.create(search_params)

SELECT  `searches`.* FROM `searches` WHERE `searches`.`id` = 3 LIMIT 1
---
    def show
    	@search =Search.find(params[:id])